In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('forbes_billionaires_geo.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         2755 non-null   object
 1   NetWorth     2755 non-null   float64
 2   Country      2755 non-null   object
 3   Source       2755 non-null   object
 4   Rank         2755 non-null   int64
 5   Age          2630 non-null   float64
 6   Residence    2715 non-null   object
 7   Citizenship  2739 non-null   object
 8   Status       2090 non-null   object
 9   Children     1552 non-null   float64
 10  Education    1409 non-null   object
 11  Self_made    2737 non-null   object
 12  geometry     2755 non-null   object
dtypes: float64(3), int64(1), object(9)
memory usage: 279.9+ KB

In [20]:
for index, row in df.iterrows():
  if row['Citizenship'] == 'Poland':
    print("hurra!")

hurra!
hurra!
hurra!
hurra!
hurra!
hurra!
hurra!
hurra!

In [24]:
polacy = (df['Citizenship'] == 'Poland')

In [25]:
polacy

0       False
1       False
2       False
3       False
4       False
        ...
2750    False
2751    False
2752    False
2753    False
2754    False
Name: Citizenship, Length: 2755, dtype: bool

In [26]:
df[polacy]

                            Name  ...                       geometry
746               Michal Solowow  ...  POINT (20.6099144 50.8540359)
851                 Jerzy Starak  ...  POINT (19.3486177 52.0941864)
957             Tomasz Biernacki  ...   POINT (17.4374158 51.695926)
978           Zygmunt Solorz-Zak  ...  POINT (21.0067249 52.2319581)
1542            Dominika Kulczyk  ...  POINT (21.0067249 52.2319581)
1972           Sebastian Kulczyk  ...   POINT (8.2319736 46.7985624)
2275               Rafal Brzoska  ...  POINT (21.0067249 52.2319581)
2305  Zbigniew Juroszek & family  ...  POINT (18.6562313 49.7557676)

[8 rows x 13 columns]

In [28]:
df.loc[polacy, 'Name':'Country']

                            Name  NetWorth Country
746               Michal Solowow       4.0  Poland
851                 Jerzy Starak       3.6  Poland
957             Tomasz Biernacki       3.2  Poland
978           Zygmunt Solorz-Zak       3.2  Poland
1542            Dominika Kulczyk       2.1  Poland
1972           Sebastian Kulczyk       1.6  Poland
2275               Rafal Brzoska       1.3  Poland
2305  Zbigniew Juroszek & family       1.3  Poland

In [29]:
df.loc[polacy, ['Name', 'NetWorth']]

                            Name  NetWorth
746               Michal Solowow       4.0
851                 Jerzy Starak       3.6
957             Tomasz Biernacki       3.2
978           Zygmunt Solorz-Zak       3.2
1542            Dominika Kulczyk       2.1
1972           Sebastian Kulczyk       1.6
2275               Rafal Brzoska       1.3
2305  Zbigniew Juroszek & family       1.3

In [32]:
df[df.Citizenship == df.Residence]

                                   Name  ...                        geometry
33    Beate Heister & Karl Albrecht Jr.  ...   POINT (10.4234469 51.0834196)
42                          Li Ka-shing  ...  POINT (114.1628131 22.2793278)
495                          Rene Benko  ...               POINT (13.2 47.2)
557           Lee Yeow Chor & Yeow Seng  ...   POINT (102.2656823 4.5693754)
747                Udo & Harald Tschira  ...   POINT (10.4234469 51.0834196)
1007             Wilhelm Beier & family  ...   POINT (10.4234469 51.0834196)
1144                            Rudy Ma  ...  POINT (120.9820179 23.9739374)
1266                        Hans Langer  ...   POINT (10.4234469 51.0834196)
1288                       André Street  ...       POINT (-53.2 -10.3333333)
1354                     David Wertheim  ...   POINT (34.8667654 31.5313113)
2012                        Tseng Cheng  ...  POINT (120.9820179 23.9739374)
2176                        Jitse Groen  ...    POINT (5.7480821 52.5001698)
2306                     André Kasprzak  ...    POINT (10.3333283 55.670249)
2358                      Masaru Wasami  ...  POINT (139.2394179 36.5748441)
2639                      Tseng Sing-ai  ...  POINT (120.9820179 23.9739374)

[15 rows x 13 columns]

In [33]:
df.Status.value_counts()

Married               1734
Divorced               144
Widowed                 95
Single                  74
In Relationship         21
Separated               10
Widowed, Remarried       8
Engaged                  4
Name: Status, dtype: int64

In [34]:
sl = {
    'Married': 'yes',
    'Divorced': 'no',
    'Widowed': 'no',
    'Single': 'no',
    'In Relationship': 'yes',
    'Separated': 'no',
    'Widowed, Remarried': 'yes',
    'Engaged': 'yes'
}

In [37]:
sl

{'Divorced': 'no',
 'Engaged': 'yes',
 'In Relationship': 'yes',
 'Married': 'yes',
 'Separated': 'no',
 'Single': 'no',
 'Widowed': 'no',
 'Widowed, Remarried': 'yes'}

In [38]:
df.Status.replace(sl)

0       yes
1       yes
2       yes
3        no
4       yes
       ...
2750    NaN
2751    NaN
2752    NaN
2753    NaN
2754    yes
Name: Status, Length: 2755, dtype: object

In [41]:
df.Status.value_counts(dropna=False)

Married               1734
NaN                    665
Divorced               144
Widowed                 95
Single                  74
In Relationship         21
Separated               10
Widowed, Remarried       8
Engaged                  4
Name: Status, dtype: int64

In [42]:
def vc(s):
  return s.value_counts(dropna=False)

In [43]:
vc(df.Status)

Married               1734
NaN                    665
Divorced               144
Widowed                 95
Single                  74
In Relationship         21
Separated               10
Widowed, Remarried       8
Engaged                  4
Name: Status, dtype: int64

In [47]:
df['relationship'] = df.Status.replace(sl)

In [49]:
vc(df.relationship)

yes    1767
NaN     665
no      323
Name: relationship, dtype: int64

In [53]:
a = list(df.Status.value_counts().index)

In [54]:
a

['Married',
 'Divorced',
 'Widowed',
 'Single',
 'In Relationship',
 'Separated',
 'Widowed, Remarried',
 'Engaged']

In [55]:
b = ['yes', 'no', 'no', 'no', 'yes', 'no', 'yes', 'yes']

In [56]:
dict(zip(a, b))

{'Divorced': 'no',
 'Engaged': 'yes',
 'In Relationship': 'yes',
 'Married': 'yes',
 'Separated': 'no',
 'Single': 'no',
 'Widowed': 'no',
 'Widowed, Remarried': 'yes'}

In [59]:
b = ['yes'] + ['no'] * 3 + ['yes'] + ['no'] + ['yes'] * 2

In [60]:
b

['yes', 'no', 'no', 'no', 'yes', 'no', 'yes', 'yes']

In [61]:
!pip install pingouin

Collecting pingouin
  Downloading https://files.pythonhosted.org/packages/5c/40/7736d4fcb8dbb6758a1e9ca51754e60ff4efe5d7c9b5bb6166cff538513d/pingouin-0.3.11.tar.gz (204kB)
     |████████████████████████████████| 204kB 20.1MB/s
Requirement already satisfied: numpy>=1.15 in /usr/local/lib/python3.7/dist-packages (from pingouin) (1.19.5)
Requirement already satisfied: scipy>=1.3 in /usr/local/lib/python3.7/dist-packages (from pingouin) (1.4.1)
Requirement already satisfied: pandas>=0.24 in /usr/local/lib/python3.7/dist-packages (from pingouin) (1.1.5)
Requirement already satisfied: matplotlib>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from pingouin) (3.2.2)
Requirement already satisfied: seaborn>=0.9.0 in /usr/local/lib/python3.7/dist-packages (from pingouin) (0.11.1)
Requirement already satisfied: statsmodels>=0.10.0 in /usr/local/lib/python3.7/dist-packages (from pingouin) (0.10.2)
Requirement already satisfied: scikit-learn in /usr/local/lib/python3.7/dist-packages (from pingouin) (0.22.2.post1)
Collecting pandas_flavor>=0.1.2
  Downloading https://files.pythonhosted.org/packages/9a/57/7fbcff4c0961ed190ac5fcb0bd8194152ee1ee6487edf64fdbae16e2bc4b/pandas_flavor-0.2.0-py2.py3-none-any.whl
Collecting outdated
  Downloading https://files.pythonhosted.org/packages/fd/f6/95588d496e518355c33b389222c99069b1c6f2c046be64f400072fdc7cda/outdated-0.2.1-py3-none-any.whl
Requirement already satisfied: tabulate in /usr/local/lib/python3.7/dist-packages (from pingouin) (0.8.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.24->pingouin) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.24->pingouin) (2018.9)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=3.0.2->pingouin) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=3.0.2->pingouin) (2.4.7)
Requirement already satisfied: kiwisolver>=1.0.1 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=3.0.2->pingouin) (1.3.1)
Requirement already satisfied: patsy>=0.4.0 in /usr/local/lib/python3.7/dist-packages (from statsmodels>=0.10.0->pingouin) (0.5.1)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from scikit-learn->pingouin) (1.0.1)
Requirement already satisfied: xarray in /usr/local/lib/python3.7/dist-packages (from pandas_flavor>=0.1.2->pingouin) (0.15.1)
Collecting littleutils
  Downloading https://files.pythonhosted.org/packages/4e/b1/bb4e06f010947d67349f863b6a2ad71577f85590180a935f60543f622652/littleutils-0.2.2.tar.gz
Requirement already satisfied: requests in /usr/local/lib/python3.7/dist-packages (from outdated->pingouin) (2.23.0)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas>=0.24->pingouin) (1.15.0)
Requirement already satisfied: setuptools>=41.2 in /usr/local/lib/python3.7/dist-packages (from xarray->pandas_flavor>=0.1.2->pingouin) (56.1.0)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests->outdated->pingouin) (2.10)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.7/dist-packages (from requests->outdated->pingouin) (2020.12.5)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.7/dist-packages (from requests->outdated->pingouin) (1.24.3)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests->outdated->pingouin) (3.0.4)
Building wheels for collected packages: pingouin, littleutils
  Building wheel for pingouin (setup.py) ... done
  Created wheel for pingouin: filename=pingouin-0.3.11-cp37-none-any.whl size=203325 sha256=a1b9301e62fe22d8197af1ef28b38548150ec7e444af4a9e7831ab63fb4f16e6
  Stored in directory: /root/.cache/pip/wheels/79/46/ef/e377eb45c86f278f660d31c4a30e3f733063d28c89462f1aea
  Building wheel for littleutils (setup.py) ... done
  Created wheel for littleutils: filename=littleutils-0.2.2-cp37-none-any.whl size=7051 sha256=008a2769f8469a7f218d88504fd6cc34b9489a204dcad491ca01a5341e94982f
  Stored in directory: /root/.cache/pip/wheels/53/16/9f/ac67d15c40243754fd73f620e1b9b6dedc20492ecc19a2bae1
Successfully built pingouin littleutils
Installing collected packages: pandas-flavor, littleutils, outdated, pingouin
Successfully installed littleutils-0.2.2 outdated-0.2.1 pandas-flavor-0.2.0 pingouin-0.3.11

In [62]:
import pingouin as png

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          2755 non-null   object
 1   NetWorth      2755 non-null   float64
 2   Country       2755 non-null   object
 3   Source        2755 non-null   object
 4   Rank          2755 non-null   int64
 5   Age           2630 non-null   float64
 6   Residence     2715 non-null   object
 7   Citizenship   2739 non-null   object
 8   Status        2090 non-null   object
 9   Children      1552 non-null   float64
 10  Education     1409 non-null   object
 11  Self_made     2737 non-null   object
 12  geometry      2755 non-null   object
 13  relationship  2090 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 301.5+ KB

In [65]:
df.NetWorth

0       177.0
1       151.0
2       150.0
3       124.0
4        97.0
        ...
2750      1.0
2751      1.0
2752      1.0
2753      1.0
2754      1.0
Name: NetWorth, Length: 2755, dtype: float64

In [66]:
df.Age

0       57.0
1       49.0
2       72.0
3       65.0
4       36.0
        ...
2750    49.0
2751    65.0
2752    58.0
2753    58.0
2754    54.0
Name: Age, Length: 2755, dtype: float64

In [67]:
png.corr(df.NetWorth, df.Age)

            n         r          CI95%  ...     p-val   BF10     power
pearson  2630  0.032572  [-0.01, 0.07]  ...  0.094911  0.098  0.386176

[1 rows x 8 columns]

In [72]:
self_made = (df.Self_made == True)

In [73]:
df[self_made]

                   Name  ...  relationship
0            Jeff Bezos  ...           yes
1             Elon Musk  ...           yes
3            Bill Gates  ...            no
4       Mark Zuckerberg  ...           yes
5        Warren Buffett  ...           yes
...                 ...  ...           ...
2750  Daniel Yong Zhang  ...           NaN
2751      Zhang Yuqiang  ...           NaN
2752      Zhao Meiguang  ...           NaN
2753     Zhong Naixiong  ...           NaN
2754    Zhou Wei family  ...           yes

[1960 rows x 14 columns]

In [74]:
png.corr(df[self_made].NetWorth, df[self_made].Age)

            n         r          CI95%  ...     p-val   BF10     power
pearson  1901  0.008989  [-0.04, 0.05]  ...  0.695302  0.031  0.067747

[1 rows x 8 columns]

In [87]:
df.Children == 0

0       False
1       False
2       False
3       False
4       False
        ...
2750    False
2751    False
2752    False
2753    False
2754    False
Name: Children, Length: 2755, dtype: bool

In [93]:
dzietni = (df.loc[df['Children'] >= 1, 'NetWorth'])
bezdzietni = (df.loc[df['Children'].isna(), 'NetWorth'])

In [97]:
dzietni

0       177.0
1       151.0
2       150.0
3       124.0
4        97.0
        ...
2737      1.0
2738      1.0
2742      1.0
2743      1.0
2746      1.0
Name: NetWorth, Length: 1552, dtype: float64

In [95]:
df['Children'].isna()

0       False
1       False
2       False
3       False
4       False
        ...
2750     True
2751     True
2752     True
2753     True
2754     True
Name: Children, Length: 2755, dtype: bool

In [98]:
png.ttest(dzietni, bezdzietni)

               T          dof       tail  ...   cohen-d       BF10     power
T-test  5.535121  2346.505657  two-sided  ...  0.196433  1.649e+05  0.999189

[1 rows x 8 columns]

In [99]:
dzietni.mean()

5.570231958762908

In [100]:
bezdzietni.mean()

3.6900249376558794

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          2755 non-null   object
 1   NetWorth      2755 non-null   float64
 2   Country       2755 non-null   object
 3   Source        2755 non-null   object
 4   Rank          2755 non-null   int64
 5   Age           2630 non-null   float64
 6   Residence     2715 non-null   object
 7   Citizenship   2739 non-null   object
 8   Status        2090 non-null   object
 9   Children      1552 non-null   float64
 10  Education     1409 non-null   object
 11  Self_made     2737 non-null   object
 12  geometry      2755 non-null   object
 13  relationship  2090 non-null   object
dtypes: float64(3), int64(1), object(10)
memory usage: 301.5+ KB

In [103]:
e, o, stats = png.chi2_independence(df, 'relationship', 'Self_made')

In [104]:
e

Self_made          False        True
relationship
no             96.127273   226.872727
yes           525.872727  1241.127273

In [105]:
o

Self_made     False   True
relationship
no            148.5   174.5
yes           473.5  1293.5

In [106]:
stats

                 test    lambda       chi2  ...          pval    cramer     power
0             pearson  1.000000  48.050037  ...  4.154798e-12  0.132064  1.000000
1        cressie-read  0.666667  46.961208  ...  7.240572e-12  0.130560  1.000000
2      log-likelihood  0.000000  45.146536  ...  1.828288e-11  0.128012  0.999999
3       freeman-tukey -0.500000  44.072070  ...  3.165051e-11  0.126480  0.999999
4  mod-log-likelihood -1.000000  43.218332  ...  4.895980e-11  0.125249  0.999998
5              neyman -2.000000  42.102716  ...  8.660282e-11  0.123622  0.999997

[6 rows x 7 columns]